---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.WaterChillerType
source: html/cd39b693-4371-4f82-98f7-a581ee288f4d.htm
---
# Autodesk.Revit.DB.Mechanical.WaterChillerType

The type of water chiller.

## Syntax (C#)
```csharp
public enum WaterChillerType
```